## 16FEB
### ASSIGNMENT

### Q1

In [ ]:
Q1. What is a database? Differentiate between SQL and NoSQL databases.

In [ ]:
Ans:- 
A database is a structured collection of data that is organized and stored in a way that enables efficient 
retrieval and manipulation of the data. Databases are commonly used in many areas of computing, including business,
science, and entertainment.

There are two main types of databases: SQL and NoSQL.

SQL databases, also known as relational databases, store data in tables with rows and columns, where each row 
represents a unique record and each column represents a specific piece of data. The tables are then linked to 
each other using relationships defined by foreign keys. SQL databases use a query language called Structured Query
Language (SQL) to access and manipulate the data. Examples of SQL databases include MySQL, Oracle, and Microsoft
SQL Server.

NoSQL databases, on the other hand, are non-relational and do not store data in tables. Instead, they use various 
data models, including document-oriented, key-value, column-oriented, and graph-based models, to store data in a
flexible and scalable way. NoSQL databases typically offer better performance and scalability than SQL databases,
making them a popular choice for handling large amounts of unstructured data. However, NoSQL databases may not 
offer the same level of consistency and reliability as SQL databases. Examples of NoSQL databases include MongoDB,
Cassandra, and Amazon DynamoDB.

The choice between SQL and NoSQL databases depends on the specific requirements of the application, such as the
type and volume of data, the need for scalability, and the desired level of consistency and reliability. SQL 
databases are often a good choice for applications that require strong consistency and structured data, while
NoSQL databases are often a good choice for applications that require flexibility, scalability, and handling of
unstructured data.

### Q2

In [ ]:
Q2. What is DDL? Explain why CREATE, DROP, ALTER, and TRUNCATE are used with an example.

In [ ]:
DDL stands for Data Definition Language, which is a subset of SQL used to define and manage the structure of a 
database. DDL statements are used to create, modify, and delete database objects, such as tables, indexes, and
views.

Here are some examples of DDL statements and how they are used:

=> CREATE statement: The CREATE statement is used to create a new database object, such as a table or view. 
For example, to create a new table called "employees" with columns for employee ID, name, and salary, the
following SQL code could be used:

In [ ]:
CREATE TABLE employees (
   employee_id INT PRIMARY KEY,
   name VARCHAR(50) NOT NULL,
   salary DECIMAL(10,2) NOT NULL
);

In [ ]:
=> DROP statement: The DROP statement is used to delete an existing database object, such as a table or view. 
For example, to delete the "employees" table created above, the following SQL code could be used:

In [ ]:
DROP TABLE employees;

In [ ]:
=> ALTER statement: The ALTER statement is used to modify an existing database object, such as adding or deleting 
columns in a table. For example, to add a new column called "department" to the "employees" table created above, 
the following SQL code could be used:

In [ ]:
ALTER TABLE employees ADD COLUMN department VARCHAR(50);

In [ ]:
=> TRUNCATE statement: The TRUNCATE statement is used to remove all data from a table while keeping the table 
structure intact. For example, to remove all data from the "employees" table created above, the following SQL code
could be used:

In [ ]:
TRUNCATE TABLE employees;

In [ ]:
In summary, DDL statements are used to define and manage the structure of a database, including creating,
modifying, and deleting database objects. CREATE is used to create a new object, DROP is used to delete an object,
ALTER is used to modify an object, and TRUNCATE is used to remove all data from an object while keeping the 
structure intact.

### Q3

In [ ]:
Q3. What is DML? Explain INSERT, UPDATE, and DELETE with an example.

In [ ]:
Ans:- DML stands for Data Manipulation Language, which is a subset of SQL used to manipulate data within a
database. DML statements are used to insert, update, and delete data in database tables.

Here are some examples of DML statements and how they are used:

=> INSERT statement: The INSERT statement is used to add new data to a table. For example, to add a new employee 
to the "employees" table created in the previous question, the following SQL code could be used:

In [ ]:
INSERT INTO employees (employee_id, name, salary, department) VALUES (1, 'John Doe', 50000.00, 'Sales');

In [ ]:
This statement will add a new row to the "employees" table with the values for the columns specified in the 
parentheses.

=> UPDATE statement: The UPDATE statement is used to modify existing data in a table. For example, to update the
salary of the employee with the ID of 1 in the "employees" table, the following SQL code could be used:

In [ ]:
UPDATE employees SET salary = 60000.00 WHERE employee_id = 1;

In [ ]:
This statement will update the "salary" column for the row where the "employee_id" is equal to 1.

=> DELETE statement: The DELETE statement is used to remove data from a table. For example, to remove the
employee with the ID of 1 from the "employees" table, the following SQL code could be used:

In [ ]:
DELETE FROM employees WHERE employee_id = 1;

In [ ]:
This statement will delete the row where the "employee_id" is equal to 1.

In summary, DML statements are used to manipulate data within a database, including inserting new data with 
NSERT, updating existing data with UPDATE, and deleting data with DELETE. These statements are essential for 
managing the data in a database and are often used in conjunction with DDL statements to manage the structure 
and contents of a database.

### Q4

In [ ]:
Q4. What is DQL? Explain SELECT with an example.

In [ ]:
Ans:- DQL stands for Data Query Language, which is a subset of SQL used to retrieve data from a database. 
QL statements are used to query the data stored in database tables.

The most commonly used DQL statement is the SELECT statement. Here is an example of how the SELECT statement can 
be used to retrieve data from a table:

In [ ]:
SELECT * FROM employees;

In [ ]:
This statement will retrieve all data from the "employees" table. The asterisk (*) is a wildcard character that 
represents all columns in the table.

Here is another example of the SELECT statement that retrieves specific columns from a table and filters the 
results based on a condition:

In [ ]:
SELECT name, salary FROM employees WHERE department = 'Sales';

In [ ]:
This statement will retrieve the "name" and "salary" columns from the "employees" table for all rows where the
"department" column is equal to 'Sales'.

The SELECT statement can also be used with various SQL functions to perform calculations, formatting, and other 
operations on the data being retrieved. Here is an example of using the COUNT function to retrieve the number of 
employees in the "employees" table:

In [ ]:
SELECT COUNT(*) FROM employees;

In [ ]:
This statement will return a single value that represents the number of rows in the "employees" table.

In summary, DQL statements are used to retrieve data from a database, with the most commonly used statement being 
the SELECT statement. The SELECT statement can be used to retrieve all data from a table, specific columns from a
table, and filtered data based on conditions, and it can be used with various SQL functions to perform calculations
and other operations on the retrieved data.

### Q5

In [ ]:
Q5. Explain Primary Key and Foreign Key.

In [ ]:
Ans:- Primary Key and Foreign Key are important concepts in database design that define relationships between 
tables.

A Primary Key is a column or set of columns that uniquely identify each row in a table. The values in a primary
key column must be unique and cannot be null. A primary key is used to ensure that each row in a table is unique 
and can be accessed quickly and efficiently.

For example, consider a table named "students" that contains information about students in a school. Each student 
has a unique student ID, so the "student_id" column can be designated as the primary key for the "students" table.

A Foreign Key is a column or set of columns that links two tables together. The foreign key column in one table 
refers to the primary key column in another table. This relationship is used to ensure data consistency and 
integrity, as it ensures that data in one table matches the data in another table.

For example, consider a table named "enrollments" that contains information about which students are enrolled in 
which courses. The "enrollments" table might have a column named "student_id" that refers to the "student_id" 
column in the "students" table. This establishes a relationship between the "enrollments" table and the "students"
table, allowing data to be easily retrieved from both tables.

Here's an example of how the "enrollments" table might look:

In [ ]:
enrollment_id	course_id	student_id
     1	           101	      1234
     2	           102	      5678
     3	           103	      9012

In [ ]:
In this example, the "student_id" column in the "enrollments" table is a foreign key that refers to the primary 
key in the "students" table. This relationship ensures that the data in the "enrollments" table is consistent with 
the data in the "students" table, as it ensures that each value in the "student_id" column in the "enrollments" 
table corresponds to a valid student ID in the "students" table.

In summary, a primary key is used to uniquely identify rows in a table, while a foreign key is used to establish
relationships between tables by linking a column in one table to the primary key column in another table.

### Q6

In [ ]:
Q6. Write a python code to connect MySQL to python. Explain the cursor() and execute() method.

In [ ]:
Ans:- To connect MySQL to Python, we first need to install the mysql-connector-python library. We can install it
using pip by running the following command in the terminal:

In [ ]:
pip install mysql-connector-python

In [ ]:
Once we have installed the library, we can use the following Python code to connect to a MySQL database:

In [ ]:
import mysql.connector

# create a connection object
mydb = mysql.connector.connect(
  host="localhost",
  user="username",
  password="password",
  database="mydatabase"
)

# create a cursor object
mycursor = mydb.cursor()

# execute a SQL query
mycursor.execute("SELECT * FROM customers")

# fetch all rows of the result set
results = mycursor.fetchall()

# print the results
for row in results:
    print(row)

In [ ]:
In the code above, we first create a connection object using the mysql.connector.connect() method, passing in the 
host, username, password, and database name as parameters.

We then create a cursor object using the cursor() method of the connection object. The cursor object is used to 
execute SQL queries and fetch the results.

Next, we execute a SQL query using the execute() method of the cursor object. The query in this example selects 
all rows from the "customers" table.

After executing the query, we fetch all rows of the result set using the fetchall() method of the cursor object. 
We can then loop through the results and print each row.

The cursor() method creates a cursor object, which is used to execute SQL queries and fetch results from a 
database. The execute() method of the cursor object is used to execute a SQL query. It takes a SQL query string 
as a parameter and returns None. Once a query has been executed, we can use methods like fetchone(), fetchall(), 
and fetchmany() to fetch the results of the query.

In summary, the cursor() method is used to create a cursor object, and the execute() method is used to execute a 
SQL query on the database.

### Q7

In [ ]:
Q7. Give the order of execution of SQL clauses in an SQL query.

In [ ]:
Ans:- The order of execution of SQL clauses in an SQL query can be summarized as follows:

=> FROM clause: The FROM clause is executed first, which specifies the table or tables from which data will be 
retrieved.

=> WHERE clause: The WHERE clause is executed next, which filters the rows returned by the FROM clause based on a 
specified condition.

=> GROUP BY clause: The GROUP BY clause is executed next, which groups the rows returned by the WHERE clause based
on one or more columns.

=> HAVING clause: The HAVING clause is executed next, which filters the grouped rows based on a specified condition.

=> SELECT clause: The SELECT clause is executed next, which specifies the columns to be returned in the result set.

=> DISTINCT clause: If the DISTINCT keyword is used in the SELECT clause, duplicate rows are removed from the result
set.

=> ORDER BY clause: The ORDER BY clause is executed next, which sorts the result set based on one or more columns.

=>LIMIT clause: If the LIMIT keyword is used, the result set is limited to a specified number of rows.

Note that some clauses, such as the WHERE and HAVING clauses, can be used multiple times in a single query to 
further filter the result set. The order of execution may also be affected by the use of subqueries or joins.

Overall, understanding the order of execution of SQL clauses is important for optimizing query performance and 
ensuring that the correct data is retrieved from the database.